---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewFailures.DetailNumberEmpty
source: html/93a71b0e-6f76-f82f-38d3-3f4eec92c3b7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewFailures.DetailNumberEmpty Property

Detail Number is empty

## Syntax (C#)
```csharp
public static FailureDefinitionId DetailNumberEmpty { get; }
```